In [25]:
import pandas as pd #import pandas library
df = pd.read_csv("Salary_Data.csv")   # Read CSV dataset

In [ ]:
#use series
s = pd.Series([10, 20, 30, 40, 50], index=['a','b','c','d','e'])
print("Original:\n", s)
print("Record :",s["a"])

Original:
 a    10
b    20
c    30
d    40
e    50
dtype: int64
Record : 10

In [ ]:
#USE dataframe
d = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [24, 27, 22, 32, 29],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix']
}

d1 = pd.DataFrame(d)
print(d1)

      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago
3    David   32      Houston
4      Eva   29      Phoenix

In [ ]:
df.head() #display top 5 elements of datset

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [27]:
df.tail() #display bottom 5 elements of dataset

    YearsExperience    Salary
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [28]:
df.info() #display content of dataset

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  30 non-null     float64
 1   Salary           30 non-null     float64
dtypes: float64(2)
memory usage: 612.0 bytes

In [29]:
df.describe() #describe the dataset

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [30]:
df.min() #minimum of dataset

YearsExperience        1.1
Salary             37731.0
dtype: float64

In [31]:
df.max()#display max from dataset

YearsExperience        10.5
Salary             122391.0
dtype: float64

In [32]:
df.mean()#mean of dataset

YearsExperience        5.313333
Salary             76003.000000
dtype: float64

In [33]:
df.median() #median of dataset

YearsExperience        4.7
Salary             65237.0
dtype: float64

In [34]:
df.mode() #mode of dataset

    YearsExperience    Salary
0               3.2   37731.0
1               4.0   39343.0
2               NaN   39891.0
3               NaN   43525.0
4               NaN   46205.0
5               NaN   54445.0
6               NaN   55794.0
7               NaN   56642.0
8               NaN   56957.0
9               NaN   57081.0
10              NaN   57189.0
11              NaN   60150.0
12              NaN   61111.0
13              NaN   63218.0
14              NaN   64445.0
15              NaN   66029.0
16              NaN   67938.0
17              NaN   81363.0
18              NaN   83088.0
19              NaN   91738.0
20              NaN   93940.0
21              NaN   98273.0
22              NaN  101302.0
23              NaN  105582.0
24              NaN  109431.0
25              NaN  112635.0
26              NaN  113812.0
27              NaN  116969.0
28              NaN  121872.0
29              NaN  122391.0